In [1]:
import pandas as pd

friends = [{'age': 15, 'job' : 'student'},
           {'age': 25, 'job' : 'developer'},
           {'age': 30, 'job' : 'teacher'}
          ]

df = pd.DataFrame(friends,
                 index = ['John', 'Jenny', 'Nate'],
                 columns = ['age', 'job'])

In [2]:
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [5]:
#데이터 삭제
df.drop(['John','Nate'])

       age        job
Jenny   25  developer

In [6]:
df   #dateframe에는 정보 남아 있음

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [7]:
df =df.drop(['John','Nate'])

In [8]:
df

       age        job
Jenny   25  developer

In [17]:
df = pd.DataFrame(friends,
                 index = ['John', 'Jenny', 'Nate'],
                 columns = ['age', 'job'])

In [18]:
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [19]:
df.drop(['John', 'Nate'], inplace=True)  #바로 df에 저장

In [20]:
df

       age        job
Jenny   25  developer

In [22]:
friends = [{'name':'John','age': 15, 'job' : 'student'},
           {'name':'Jenny','age': 25, 'job' : 'developer'},
           {'name':'Nate','age': 30, 'job' : 'teacher'}
          ]

df = pd.DataFrame(friends,
                 columns = ['name','age', 'job'])

In [23]:
df  #index가 0,1,2로 바뀜

    name  age        job
0   John   15    student
1  Jenny   25  developer
2   Nate   30    teacher

In [24]:
df=df.drop(df.index[[0,2]])

In [25]:
df     #0번 2번 삭제

    name  age        job
1  Jenny   25  developer

In [27]:
df = pd.DataFrame(friends,
                 columns = ['name','age', 'job'])
df

    name  age        job
0   John   15    student
1  Jenny   25  developer
2   Nate   30    teacher

In [28]:
#20살 이상만 남김
df = df[df.age>20]
df

    name  age        job
1  Jenny   25  developer
2   Nate   30    teacher

In [29]:
df = pd.DataFrame(friends,
                 columns = ['name','age', 'job'])
df

    name  age        job
0   John   15    student
1  Jenny   25  developer
2   Nate   30    teacher

In [30]:
#age column delete
df = df.drop('age',axis=1)
df

    name        job
0   John    student
1  Jenny  developer
2   Nate    teacher

In [42]:
df = pd.DataFrame(friends,
                 columns = ['name','age', 'job'])
df

    name  age        job
0   John   15    student
1  Jenny   25  developer
2   Nate   30    teacher